 {
            "slug": "rope-trick",
            "name": "Rope Trick",
            "desc": "You touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends. The extradimensional space can be reached by climbing to the top of the rope. The space can hold as many as eight Medium or smaller creatures. The rope can be pulled into the space, making the rope disappear from view outside the space. Attacks and spells can't cross through the entrance into or out of the extradimensional space, but those inside can see out of it as if through a 3-foot-by-5-foot window centered on the rope. Anything inside the extradimensional space drops out when the spell ends.",
            "higher_level": "",
            "page": "phb 272",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Powdered corn extract and a twisted loop of parchment.",
            "ritual": "no",
            "duration": "1 hour",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Transmutation",
            "dnd_class": "Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sacred-flame",
            "name": "Sacred Flame",
            "desc": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
            "higher_level": "",
            "page": "phb 272",
            "range": "60 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "Cantrip",
            "level_int": 0,
            "school": "Evocation",
            "dnd_class": "Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sanctuary",
            "name": "Sanctuary",
            "desc": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball. If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.",
            "higher_level": "",
            "page": "phb 272",
            "range": "30 feet",
            "components": "V, S, M",
            "material": "A small silver mirror.",
            "ritual": "no",
            "duration": "1 minute",
            "concentration": "no",
            "casting_time": "1 bonus action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Abjuration",
            "dnd_class": "Cleric, Paladin",
            "archetype": "Paladin: Devotion",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "scorching-ray",
            "name": "Scorching Ray",
            "desc": "You generate three rays of fire and will throw to targets in the range of the spell. You can project them on one or more targets. Perform a remote attack spell for each department. If it hits, the target takes 2d6 fire damage.",
            "higher_level": "When you cast this spell using a 3 or higher level spell slot, you generate an additional radius for each level of higher spell slot 2.",
            "page": "phb 273",
            "range": "120 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Evocation",
            "dnd_class": "Cleric, Sorcerer, Warlock, Wizard",
            "archetype": "Cleric: Light<br/> Warlock: Fiend",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "scrying",
            "name": "Scrying",
            "desc": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed.\n\n**Knowledge & Save Modifier** Secondhand (you have heard of the target) +5 Firsthand (you have met the target) +0 Familiar (you know the target well) -5 **Connection & Save Modifier** Likeness or picture -2 Possession or garment -4 Body part, lock of hair, bit of nail, or the like -10 \nOn a successful save, the target isn't affected, and you can't use this spell against it again for 24 hours. On a failed save, the spell creates an invisible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. A creature that can see invisible objects sees the sensor as a luminous orb about the size of your fist. Instead of targeting a creature, you can choose a location you have seen before as the target of this spell. When you do, the sensor appears at that location and doesn't move.",
            "higher_level": "",
            "page": "phb 273",
            "range": "Self",
            "components": "V, S, M",
            "material": "A focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water.",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "10 minutes",
            "level": "5th-level",
            "level_int": 5,
            "school": "Divination",
            "dnd_class": "Bard, Cleric, Druid, Paladin, Warlock, Wizard",
            "archetype": "Paladin: Vengeance",
            "circles": "Coast, Swamp",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "secret-chest",
            "name": "Secret Chest",
            "desc": "You hide a chest, and all its contents, on the Ethereal Plane. You must touch the chest and the miniature replica that serves as a material component for the spell. The chest can contain up to 12 cubic feet of nonliving material (3 feet by 2 feet by 2 feet). While the chest remains on the Ethereal Plane, you can use an action and touch the replica to recall the chest. It appears in an unoccupied space on the ground within 5 feet of you. You can send the chest back to the Ethereal Plane by using an action and touching both the chest and the replica. After 60 days, there is a cumulative 5 percent chance per day that the spell's effect ends. This effect ends if you cast this spell again, if the smaller replica chest is destroyed, or if you choose to end the spell as an action. If the spell ends and the larger chest is on the Ethereal Plane, it is irretrievably lost.",
            "higher_level": "",
            "page": "phb 254",
            "range": "Touch",
            "components": "V, S, M",
            "material": "An exquisite chest, 3 feet by 2 feet by 2 feet, constructed from rare materials worth at least 5,000 gp, and a Tiny replica made from the same materials worth at least 50 gp.",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "4th-level",
            "level_int": 4,
            "school": "Conjuration",
            "dnd_class": "Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "see-invisibility",
            "name": "See Invisibility",
            "desc": "For the duration of the spell, you see invisible creatures and objects as if they were visible, and you can see through Ethereal. The ethereal objects and creatures appear ghostly translucent.",
            "higher_level": "",
            "page": "phb 274",
            "range": "Self",
            "components": "V, S, M",
            "material": "A dash of talc and a small amount of silver powder.",
            "ritual": "no",
            "duration": "1 hour",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Divination",
            "dnd_class": "Bard, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "seeming",
            "name": "Seeming",
            "desc": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a charisma saving throw, and if it succeeds, it is unaffected by this spell. The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner. The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. A creature can use its action to inspect a target and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.",
            "higher_level": "",
            "page": "phb 274",
            "range": "30 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "8 hours",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "5th-level",
            "level_int": 5,
            "school": "Illusion",
            "dnd_class": "Bard, Sorcerer, Warlock, Wizard",
            "archetype": "Warlock: Archfey",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sending",
            "name": "Sending",
            "desc": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message. You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn't arrive.",
            "higher_level": "",
            "page": "phb 274",
            "range": "Unlimited",
            "components": "V, S, M",
            "material": "A short piece of fine copper wire.",
            "ritual": "no",
            "duration": "1 round",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Evocation",
            "dnd_class": "Bard, Cleric, Warlock, Wizard",
            "archetype": "Warlock: Great Old One",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sequester",
            "name": "Sequester",
            "desc": "By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. When you cast the spell and touch the target, it becomes invisible and can't be targeted by divination spells or perceived through scrying sensors created by divination spells. If the target is a creature, it falls into a state of suspended animation. Time ceases to flow for it, and it doesn't grow older. You can set a condition for the spell to end early. The condition can be anything you choose, but it must occur or be visible within 1 mile of the target. Examples include \"after 1,000 years\" or \"when the tarrasque awakens.\" This spell also ends if the target takes any damage.",
            "higher_level": "",
            "page": "phb 274",
            "range": "Touch",
            "components": "V, S, M",
            "material": "A powder composed of diamond, emerald, ruby, and sapphire dust worth at least 5,000 gp, which the spell consumes.",
            "ritual": "no",
            "duration": "Until dispelled",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "7th-level",
            "level_int": 7,
            "school": "Transmutation",
            "dnd_class": "Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shapechange",
            "name": "Shapechange",
            "desc": "You assume the form of a different creature for the duration. The new form can be of any creature with a challenge rating equal to your level or lower. The creature can't be a construct or an undead, and you must have seen the sort of creature at least once. You transform into an average example of that creature, one without any class levels or the Spellcasting trait. Your game statistics are replaced by the statistics of the chosen creature, though you retain your alignment and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus listed in its statistics is higher than yours, use the creature's bonus in place of yours. You can't use any legendary actions or lair actions of the new form. You assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious. You retain the benefit of any features from your class, race, or other source and can use them, provided that your new form is physically capable of doing so. You can't use any special senses you have (for example, darkvision) unless your new form also has that sense. You can only speak if the creature can normally speak. When you transform, you choose whether your equipment falls to the ground, merges into the new form, or is worn by it. Worn equipment functions as normal. The DM determines whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change shape or size to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge into your new form. Equipment that merges has no effect in that state. During this spell's duration, you can use your action to assume a different form following the same restrictions and rules for the original form, with one exception: if your new form has more hit points than your current one, your hit points remain at their current value.",
            "higher_level": "",
            "page": "phb 274",
            "range": "Self",
            "components": "V, S, M",
            "material": "A jade circlet worth at least 1,500 gp, which you must place on your head before you cast the spell.",
            "ritual": "no",
            "duration": "Up to 1 hour",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "9th-level",
            "level_int": 9,
            "school": "Transmutation",
            "dnd_class": "Druid, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shatter",
            "name": "Shatter",
            "desc": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-­--foot-­--radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone,crystal, or metal has disadvantage on this saving throw. A nonmagical object that isn't being worn or carried also takes the damage if it's in the spell's area.",
            "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
            "page": "phb 275",
            "range": "60 feet",
            "components": "V, S, M",
            "material": "A burst of mica.",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Evocation",
            "dnd_class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
            "archetype": "Cleric: Tempest",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shield",
            "name": "Shield",
            "desc": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
            "higher_level": "",
            "page": "phb 275",
            "range": "Self",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "1 round",
            "concentration": "no",
            "casting_time": "1 reaction",
            "level": "1st-level",
            "level_int": 1,
            "school": "Abjuration",
            "dnd_class": "Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shield-of-faith",
            "name": "Shield of Faith",
            "desc": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.",
            "higher_level": "",
            "page": "phb 275",
            "range": "60 feet",
            "components": "V, S, M",
            "material": "A small parchment with a bit of holy text written on it.",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 bonus action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Abjuration",
            "dnd_class": "Cleric, Paladin",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shillelagh",
            "name": "Shillelagh",
            "desc": "The wood of a club or a quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.",
            "higher_level": "",
            "page": "phb 275",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Mistletoe, a shamrock leaf, and a club or quarterstaff.",
            "ritual": "no",
            "duration": "1 minute",
            "concentration": "no",
            "casting_time": "1 bonus action",
            "level": "Cantrip",
            "level_int": 0,
            "school": "Transmutation",
            "dnd_class": "Druid",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "shocking-grasp",
            "name": "Shocking Grasp",
            "desc": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can't take reactions until the start of its next turn. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
            "higher_level": "",
            "page": "phb 275",
            "range": "Touch",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "Cantrip",
            "level_int": 0,
            "school": "Evocation",
            "dnd_class": "Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "silence",
            "name": "Silence",
            "desc": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.",
            "higher_level": "",
            "page": "phb 275",
            "range": "120 feet",
            "components": "V, S",
            "material": "",
            "ritual": "yes",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Illusion",
            "dnd_class": "Bard, Cleric, Druid, Ranger, Ritual Caster",
            "archetype": "Druid: Desert",
            "circles": "Desert",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "silent-image",
            "name": "Silent Image",
            "desc": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn't accompanied by sound, smell, or other sensory effects. You can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.",
            "higher_level": "",
            "page": "phb 276",
            "range": "60 feet",
            "components": "V, S, M",
            "material": "A bit of fleece.",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Illusion",
            "dnd_class": "Bard, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "simulacrum",
            "name": "Simulacrum",
            "desc": "You shape an illusory duplicate of one beast or humanoid that is within range for the entire casting time of the spell. The duplicate is a creature, partially real and formed from ice or snow, and it can take actions and otherwise be affected as a normal creature. It appears to be the same as the original, but it has half the creature's hit point maximum and is formed without any equipment. Otherwise, the illusion uses all the statistics of the creature it duplicates. The simulacrum is friendly to you and creatures you designate. It obeys your spoken commands, moving and acting in accordance with your wishes and acting on your turn in combat. The simulacrum lacks the ability to learn or become more powerful, so it never increases its level or other abilities, nor can it regain expended spell slots. If the simulacrum is damaged, you can repair it in an alchemical laboratory, using rare herbs and minerals worth 100 gp per hit point it regains. The simulacrum lasts until it drops to 0 hit points, at which point it reverts to snow and melts instantly. If you cast this spell again, any currently active duplicates you created with this spell are instantly destroyed.",
            "higher_level": "",
            "page": "phb 276",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Snow or ice in quantities sufficient to made a life-size copy of the duplicated creature; some hair, fingernail clippings, or other piece of that creature's body placed inside the snow or ice; and powdered ruby worth 1,500 gp, sprinkled over the duplicate and consumed by the spell.",
            "ritual": "no",
            "duration": "Until dispelled",
            "concentration": "no",
            "casting_time": "12 hours",
            "level": "7th-level",
            "level_int": 7,
            "school": "Illusion",
            "dnd_class": "Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sleep",
            "name": "Sleep",
            "desc": "This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures). Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected. Undead and creatures immune to being charmed aren't affected by this spell.",
            "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
            "page": "phb 276",
            "range": "90 feet",
            "components": "V, S, M",
            "material": "A pinch of fine sand, rose petals, or a cricket.",
            "ritual": "no",
            "duration": "1 minute",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Enchantment",
            "dnd_class": "Bard, Sorcerer, Warlock, Wizard",
            "archetype": "Warlock: Archfey",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sleet-storm",
            "name": "Sleet Storm",
            "desc": "Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused. The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a dexterity saving throw. On a failed save, it falls prone. If a creature is concentrating in the spell's area, the creature must make a successful constitution saving throw against your spell save DC or lose concentration.",
            "higher_level": "",
            "page": "phb 276",
            "range": "150 feet",
            "components": "V, S, M",
            "material": "A pinch of dust and a few drops of water.",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Conjuration",
            "dnd_class": "Cleric, Druid, Sorcerer, Wizard",
            "archetype": "Cleric: Tempest",
            "circles": "Arctic",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "slow",
            "name": "Slow",
            "desc": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a wisdom saving throw or be affected by this spell for the duration. An affected target's speed is halved, it takes a -2 penalty to AC and dexterity saving throws, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn. If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn't take effect until the creature's next turn, and the creature must use its action on that turn to complete the spell. If it can't, the spell is wasted. A creature affected by this spell makes another wisdom saving throw at the end of its turn. On a successful save, the effect ends for it.",
            "higher_level": "",
            "page": "phb 277",
            "range": "120 feet",
            "components": "V, S, M",
            "material": "A drop of molasses.",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Transmutation",
            "dnd_class": "Druid, Sorcerer, Wizard",
            "archetype": "Druid: Arctic",
            "circles": "Arctic",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "spare-the-dying",
            "name": "Spare the Dying",
            "desc": "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs.",
            "higher_level": "",
            "page": "phb 277",
            "range": "Touch",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "Cantrip",
            "level_int": 0,
            "school": "Necromancy",
            "dnd_class": "Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "speak-with-animals",
            "name": "Speak with Animals",
            "desc": "You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at a minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you, at the DM's discretion.",
            "higher_level": "",
            "page": "phb 277",
            "range": "Self",
            "components": "V, S",
            "material": "",
            "ritual": "yes",
            "duration": "10 minutes",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Divination",
            "dnd_class": "Bard, Cleric, Druid, Paladin, Ranger, Ritual Caster",
            "archetype": "Cleric: Nature<br/> Paladin: Ancients",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "speak-with-dead",
            "name": "Speak with Dead",
            "desc": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days. Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn't return the creature's soul to its body, only its animating spirit. Thus, the corpse can't learn new information, doesn't comprehend anything that has happened since it died, and can't speculate about future events.",
            "higher_level": "",
            "page": "phb 277",
            "range": "10 feet",
            "components": "V, S, M",
            "material": "Burning incense.",
            "ritual": "no",
            "duration": "10 minutes",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Necromancy",
            "dnd_class": "Bard, Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "speak-with-plants",
            "name": "Speak with Plants",
            "desc": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances. You can also turn difficult terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into difficult terrain that lasts for the duration, causing vines and branches to hinder pursuers, for example. Plants might be able to perform other tasks on your behalf, at the DM's discretion. The spell doesn't enable plants to uproot themselves and move about, but they can freely move branches, tendrils, and stalks. If a plant creature is in the area, you can communicate with it as if you shared a common language, but you gain no magical ability to influence it. This spell can cause the plants created by the entangle spell to release a restrained creature.",
            "higher_level": "",
            "page": "phb 277",
            "range": "Self",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "10 minutes",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Transmutation",
            "dnd_class": "Bard, Druid, Ranger",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "spider-climb",
            "name": "Spider Climb",
            "desc": "Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.",
            "higher_level": "",
            "page": "phb 277",
            "range": "Touch",
            "components": "V, S, M",
            "material": "A drop of bitumen and a spider.",
            "ritual": "no",
            "duration": "Up to 1 hour",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Transmutation",
            "dnd_class": "Druid, Sorcerer, Warlock, Wizard",
            "archetype": "Druid: Forest, Mountain, Underdark",
            "circles": "Forest, Mountain, Underdark",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "spike-growth",
            "name": "Spike Growth",
            "desc": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels. The development of land is camouflaged to look natural. Any creature that does not see the area when the spell is spell casts must make a Wisdom (Perception) opposite the DD backup your fate or it does not recognize the dangerous nature of the ground before entering.",
            "higher_level": "",
            "page": "phb 277",
            "range": "150 feet",
            "components": "V, S, M",
            "material": "Seven sharp spines or seven twigs cut peak.",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Transmutation",
            "dnd_class": "Cleric, Druid, Ranger",
            "archetype": "Cleric: Nature",
            "circles": "Arctic, Mountain",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "spirit-guardians",
            "name": "Spirit Guardians",
            "desc": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish. When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (if you are good or neutral) or 3d8 necrotic damage (if you are evil). On a successful save, the creature takes half as much damage.",
            "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
            "page": "phb 278",
            "range": "Self",
            "components": "V, S, M",
            "material": "A holy symbol.",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Conjuration",
            "dnd_class": "Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "spiritual-weapon",
            "name": "Spiritual Weapon",
            "desc": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier. As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it. The weapon can take whatever form you choose. Clerics of deities who are associated with a particular weapon (as St. Cuthbert is known for his mace and Thor for his hammer) make this spell's effect resemble that weapon.",
            "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for every two slot levels above the 2nd.",
            "page": "phb 278",
            "range": "60 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "1 minute",
            "concentration": "no",
            "casting_time": "1 bonus action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Evocation",
            "dnd_class": "Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "stinking-cloud",
            "name": "Stinking Cloud",
            "desc": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration. Each creature that is completely within the cloud at the start of its turn must make a constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw. A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.",
            "higher_level": "",
            "page": "phb 278",
            "range": "90 feet",
            "components": "V, S, M",
            "material": "A rotten egg or several skunk cabbage leaves.",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Conjuration",
            "dnd_class": "Bard, Druid, Sorcerer, Warlock, Wizard",
            "archetype": "Druid: Swamp, Underdark<br/> Warlock: Fiend",
            "circles": "Swamp, Underdark",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "stone-shape",
            "name": "Stone Shape",
            "desc": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible.",
            "higher_level": "",
            "page": "phb 278",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Soft clay, to be crudely worked into the desired shape for the stone object.",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "4th-level",
            "level_int": 4,
            "school": "Transmutation",
            "dnd_class": "Cleric, Druid, Wizard",
            "archetype": "",
            "circles": "Mountain, Underdark",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "stoneskin",
            "name": "Stoneskin",
            "desc": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.",
            "higher_level": "",
            "page": "phb 278",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Diamond dust worth 100 gp, which the spell consumes.",
            "ritual": "no",
            "duration": "Up to 1 hour",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "4th-level",
            "level_int": 4,
            "school": "Abjuration",
            "dnd_class": "Cleric, Druid, Paladin, Ranger, Sorcerer, Wizard",
            "archetype": "Cleric: War<br/> Paladin: Ancients",
            "circles": "Mountain",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "storm-of-vengeance",
            "name": "Storm of Vengeance",
            "desc": "A churning storm cloud forms, centered on a point you can see and spreading to a radius of 360 feet. Lightning flashes in the area, thunder booms, and strong winds roar. Each creature under the cloud (no more than 5,000 feet beneath the cloud) when it appears must make a constitution saving throw. On a failed save, a creature takes 2d6 thunder damage and becomes deafened for 5 minutes. Each round you maintain concentration on this spell, the storm produces additional effects on your turn.\n\n**Round 2.** Acidic rain falls from the cloud. Each creature and object under the cloud takes 1d6 acid damage.\n\n**Round 3.** You call six bolts of lightning from the cloud to strike six creatures or objects of your choice beneath the cloud. A given creature or object can't be struck by more than one bolt. A struck creature must make a dexterity saving throw. The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.\n\n**Round 4.** Hailstones rain down from the cloud. Each creature under the cloud takes 2d6 bludgeoning damage.\n\n**Round 5-10.** Gusts and freezing rain assail the area under the cloud. The area becomes difficult terrain and is heavily obscured. Each creature there takes 1d6 cold damage. Ranged weapon attacks in the area are impossible. The wind and rain count as a severe distraction for the purposes of maintaining concentration on spells. Finally, gusts of strong wind (ranging from 20 to 50 miles per hour) automatically disperse fog, mists, and similar phenomena in the area, whether mundane or magical.",
            "higher_level": "",
            "page": "phb 279",
            "range": "Sight",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "9th-level",
            "level_int": 9,
            "school": "Conjuration",
            "dnd_class": "Druid",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "suggestion",
            "name": "Suggestion",
            "desc": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell. The target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed. If you or any of your companions damage the target, the spell ends.",
            "higher_level": "",
            "page": "phb 279",
            "range": "30 feet",
            "components": "V, M",
            "material": "A snake's tongue and either a bit of honeycomb or a drop of sweet oil.",
            "ritual": "no",
            "duration": "Up to 8 hours",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "2nd-level",
            "level_int": 2,
            "school": "Enchantment",
            "dnd_class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
            "archetype": "Cleric: Knowledge",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sunbeam",
            "name": "Sunbeam",
            "desc": "A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead and oozes have disadvantage on this saving throw. You can create a new line of radiance as your action on any turn until the spell ends. For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight.",
            "higher_level": "",
            "page": "phb 279",
            "range": "Self",
            "components": "V, S, M",
            "material": "A magnifying glass.",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "6th-level",
            "level_int": 6,
            "school": "Evocation",
            "dnd_class": "Druid, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "sunburst",
            "name": "Sunburst",
            "desc": "Brilliant sunlight flashes in a 60-foot radius centered on a point you choose within range. Each creature in that light must make a constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead and oozes have disadvantage on this saving throw. A creature blinded by this spell makes another constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded. This spell dispels any darkness in its area that was created by a spell.",
            "higher_level": "",
            "page": "phb 279",
            "range": "150 feet",
            "components": "V, S, M",
            "material": "Fire and a piece of sunstone.",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "8th-level",
            "level_int": 8,
            "school": "Evocation",
            "dnd_class": "Druid, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "symbol",
            "name": "Symbol",
            "desc": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered. The glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it. You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph. You can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password. When you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there.\n\n**Death.** Each target must make a constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save\n\n **Discord.** Each target must make a constitution saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks.\n\n**Fear.** Each target must make a wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able.\n\n**Hopelessness.** Each target must make a charisma saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects.\n\n**Insanity.** Each target must make an intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic.\n\n**Pain.** Each target must make a constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save.\n\n**Sleep.** Each target must make a wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake.\n\n**Stunning.** Each target must make a wisdom saving throw and becomes stunned for 1 minute on a failed save.",
            "higher_level": "",
            "page": "phb 280",
            "range": "Touch",
            "components": "V, S, M",
            "material": "Mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes.",
            "ritual": "no",
            "duration": "Until dispelled or triggered",
            "concentration": "no",
            "casting_time": "1 minute",
            "level": "7th-level",
            "level_int": 7,
            "school": "Abjuration",
            "dnd_class": "Bard, Cleric, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "telekinesis",
            "name": "Telekinesis",
            "desc": "You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.\n\n**Creature.** You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature's Strength check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air. On subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest.\n\n**Object.** You can try to move an object that weighs up to 1,000 pounds. If the object isn't being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell. If the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature's Strength check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell. You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.",
            "higher_level": "",
            "page": "phb 280",
            "range": "60 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Up to 10 minutes",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "5th-level",
            "level_int": 5,
            "school": "Transmutation",
            "dnd_class": "Sorcerer, Warlock, Wizard",
            "archetype": "Warlock: Great Old One",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "telepathic-bond",
            "name": "Telepathic Bond",
            "desc": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with Intelligence scores of 2 or less aren't affected by this spell. Until the spell ends, the targets can communicate telepathically through the bond whether or not they have a common language. The communication is possible over any distance, though it can't extend to other planes of existence.",
            "higher_level": "",
            "page": "srd 183",
            "range": "30 feet",
            "components": "V, S, M",
            "material": "Pieces of eggshell from two different kinds of creatures",
            "ritual": "yes",
            "duration": "1 hour",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "5th-level",
            "level_int": 5,
            "school": "Divination",
            "dnd_class": "Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "teleport",
            "name": "Teleport",
            "desc": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature. The destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The DM rolls d100 and consults the table.\n\n**Familiarity.** \"Permanent circle\" means a permanent teleportation circle whose sigil sequence you know. \"Associated object\" means that you possess an object taken from the desired destination within the last six months, such as a book from a wizard's library, bed linen from a royal suite, or a chunk of marble from a lich's secret tomb. \"Very familiar\" is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell. \"Seen casually\" is someplace you have seen more than once but with which you aren't very familiar. \"Viewed once\" is a place you have seen once, possibly using magic. \"Description\" is a place whose location and appearance you know through someone else's description, perhaps from a map. \"False destination\" is a place that doesn't exist. Perhaps you tried to scry an enemy's sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists.\n\n**On Target.** You and your group (or the target object) appear where you want to.\n\n**Off Target.** You and your group (or the target object) appear a random distance away from the destination in a random direction. Distance off target is 1d10 × 1d10 percent of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15 percent, or 18 miles. The GM determines the direction off target randomly by rolling a d8 and designating 1 as north, 2 as northeast, 3 as east, and so on around the points of the compass. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble.\n\n**Similar Area.** You and your group (or the target object) wind up in a different area that's visually or thematically similar to the target area. If you are heading for your home laboratory, for example, you might wind up in another wizard's laboratory or in an alchemical supply shop that has many of the same tools and implements as your laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane.\n\n**Mishap.** The spell's unpredictable magic results in a difficult journey. Each teleporting creature (or the target object) takes 3d10 force damage, and the GM rerolls on the table to see where you wind up (multiple mishaps can occur, dealing damage each time).",
            "higher_level": "",
            "page": "phb 281",
            "range": "10 feet",
            "components": "V",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "7th-level",
            "level_int": 7,
            "school": "Conjuration",
            "dnd_class": "Bard, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "teleportation-circle",
            "name": "Teleportation Circle",
            "desc": "As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you. A shimmering portal opens within the circle you drew and remains open until the end of your next turn. Any creature that enters the portal instantly appears within 5 feet of the destination circle or in the nearest unoccupied space if that space is occupied. Many major temples, guilds, and other important places have permanent teleportation circles inscribed somewhere within their confines. Each such circle includes a unique sigil sequence-a string of magical runes arranged in a particular pattern. When you first gain the ability to cast this spell, you learn the sigil sequences for two destinations on the Material Plane, determined by the DM. You can learn additional sigil sequences during your adventures. You can commit a new sigil sequence to memory after studying it for 1 minute. You can create a permanent teleportation circle by casting this spell in the same location every day for one year. You need not use the circle to teleport when you cast the spell in this way.",
            "higher_level": "",
            "page": "phb 282",
            "range": "10 feet",
            "components": "V, M",
            "material": "Rare chalks and inks infused with precious gems with 50 gp, which the spell consumes.",
            "ritual": "no",
            "duration": "1 round",
            "concentration": "no",
            "casting_time": "1 minute",
            "level": "5th-level",
            "level_int": 5,
            "school": "Conjuration",
            "dnd_class": "Bard, Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "thaumaturgy",
            "name": "Thaumaturgy",
            "desc": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range. \n- Your voice booms up to three times as loud as normal for 1 minute. \n- You cause flames to flicker, brighten, dim, or change color for 1 minute. \n- You cause harmless tremors in the ground for 1 minute. \n- You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers. \n- You instantaneously cause an unlocked door or window to fly open or slam shut. \n- You alter the appearance of your eyes for 1 minute. \nIf you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.",
            "higher_level": "",
            "page": "phb 282",
            "range": "30 feet",
            "components": "V",
            "material": "",
            "ritual": "no",
            "duration": "1 minute",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "Cantrip",
            "level_int": 0,
            "school": "Transmutation",
            "dnd_class": "Cleric",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "thunderwave",
            "name": "Thunderwave",
            "desc": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet.",
            "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
            "page": "phb 282",
            "range": "Self",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "1st-level",
            "level_int": 1,
            "school": "Evocation",
            "dnd_class": "Bard, Cleric, Druid, Sorcerer, Wizard",
            "archetype": "Cleric: Tempest",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "time-stop",
            "name": "Time Stop",
            "desc": "You briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal. This spell ends if one of the actions you use during this period, or any effects that you create during this period, affects a creature other than you or an object being worn or carried by someone other than you. In addition, the spell ends if you move to a place more than 1,000 feet from the location where you cast it.",
            "higher_level": "",
            "page": "phb 283",
            "range": "Self",
            "components": "V",
            "material": "",
            "ritual": "no",
            "duration": "Instantaneous",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "9th-level",
            "level_int": 9,
            "school": "Transmutation",
            "dnd_class": "Sorcerer, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "tiny-hut",
            "name": "Tiny Hut",
            "desc": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area. Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can't extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside. Until the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.",
            "higher_level": "",
            "page": "phb 255",
            "range": "Self",
            "components": "V, S, M",
            "material": "A small crystal bead.",
            "ritual": "yes",
            "duration": "8 hours",
            "concentration": "no",
            "casting_time": "1 minute",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Evocation",
            "dnd_class": "Bard, Ritual Caster, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "tongues",
            "name": "Tongues",
            "desc": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.",
            "higher_level": "",
            "page": "phb 283",
            "range": "Touch",
            "components": "V, M",
            "material": "A small clay model of a ziggurat.",
            "ritual": "no",
            "duration": "1 hour",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "3rd-level",
            "level_int": 3,
            "school": "Divination",
            "dnd_class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "transport-via-plants",
            "name": "Transport via Plants",
            "desc": "This spell creates a magical link between a Large or larger inanimate plant within range and another plant, at any distance, on the same plane of existence. You must have seen or touched the destination plant at least once before. For the duration, any creature can step into the target plant and exit from the destination plant by using 5 feet of movement.",
            "higher_level": "",
            "page": "phb 283",
            "range": "10 feet",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "1 round",
            "concentration": "no",
            "casting_time": "1 action",
            "level": "6th-level",
            "level_int": 6,
            "school": "Conjuration",
            "dnd_class": "Druid",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "tree-stride",
            "name": "Tree Stride",
            "desc": "You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You instantly know the location of all other trees of the same kind within 500 feet and, as part of the move used to enter the tree, can either pass into one of those trees or step out of the tree you're in. You appear in a spot of your choice within 5 feet of the destination tree, using another 5 feet of movement. If you have no movement left, you appear within 5 feet of the tree you entered. You can use this transportation ability once per round for the duration. You must end each turn outside a tree.",
            "higher_level": "",
            "page": "phb 283",
            "range": "Self",
            "components": "V, S",
            "material": "",
            "ritual": "no",
            "duration": "Up to 1 minute",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "5th-level",
            "level_int": 5,
            "school": "Conjuration",
            "dnd_class": "Cleric, Druid, Paladin, Ranger",
            "archetype": "Cleric: Nature<br/> Paladin: Ancients",
            "circles": "Forest",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        },
        {
            "slug": "true-polymorph",
            "name": "True Polymorph",
            "desc": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into an object, or the object into a creature (the object must be neither worn nor carried by another creature).  The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation lasts until it is dispelled. This spell has no effect on a shapechanger or a creature with 0 hit points. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell.\n\n**Creature into Creature.** If you turn a creature into another kind of creature, the new form can be any kind you choose whose challenge rating is equal to or less than the target's (or its level, if the target doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the new form. It retains its alignment and personality. The target assumes the hit points of its new form, and when it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech unless its new form is capable of such actions. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.\n\n**Object into Creature.** You can turn an object into any kind of creature, as long as the creature's size is no larger than the object's size and the creature's challenge rating is 9 or lower. The creature is friendly to you and your companions. It acts on each of your turns. You decide what action it takes and how it moves. The DM has the creature's statistics and resolves all of its actions and movement. If the spell becomes permanent, you no longer control the creature. It might remain friendly to you, depending on how you have treated it.\n\n **Creature into Object.** If you turn a creature into an object, it transforms along with whatever it is wearing and carrying into that form. The creature's statistics become those of the object, and the creature has no memory of time spent in this form, after the spell ends and it returns to its normal form.",
            "higher_level": "",
            "page": "phb 283",
            "range": "30 feet",
            "components": "V, S, M",
            "material": "A drop of mercury, a dollop of gum arabic, and a wisp of smoke.",
            "ritual": "no",
            "duration": "Up to 1 hour",
            "concentration": "yes",
            "casting_time": "1 action",
            "level": "9th-level",
            "level_int": 9,
            "school": "Transmutation",
            "dnd_class": "Bard, Warlock, Wizard",
            "archetype": "",
            "circles": "",
            "document__slug": "wotc-srd",
            "document__title": "Systems Reference Document",
            "document__license_url": "http://open5e.com/legal"
        }
